{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v2.7.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_6", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_4"}, "name": "input_4", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_159", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [7, 7], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_159", "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_159", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_159", "inbound_nodes": [[["conv2d_159", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_152", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_152", "inbound_nodes": [[["batch_normalization_159", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_3", "inbound_nodes": [[["activation_152", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_161", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_161", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_161", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_161", "inbound_nodes": [[["conv2d_161", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_153", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_153", "inbound_nodes": [[["batch_normalization_161", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_162", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_162", "inbound_nodes": [[["activation_153", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_162", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_162", "inbound_nodes": [[["conv2d_162", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_154", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_154", "inbound_nodes": [[["batch_normalization_162", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_163", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_163", "inbound_nodes": [[["activation_154", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_160", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_160", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_163", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_163", "inbound_nodes": [[["conv2d_163", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_160", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_160", "inbound_nodes": [[["conv2d_160", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_48", "trainable": true, "dtype": "float32"}, "name": "add_48", "inbound_nodes": [[["batch_normalization_163", 0, 0, {}], ["batch_normalization_160", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_155", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_155", "inbound_nodes": [[["add_48", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_164", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_164", "inbound_nodes": [[["activation_155", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_164", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_164", "inbound_nodes": [[["conv2d_164", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_156", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_156", "inbound_nodes": [[["batch_normalization_164", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_165", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_165", "inbound_nodes": [[["activation_156", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_165", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_165", "inbound_nodes": [[["conv2d_165", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_157", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_157", "inbound_nodes": [[["batch_normalization_165", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_166", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_166", "inbound_nodes": [[["activation_157", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_166", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_166", "inbound_nodes": [[["conv2d_166", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_49", "trainable": true, "dtype": "float32"}, "name": "add_49", "inbound_nodes": [[["batch_normalization_166", 0, 0, {}], ["activation_155", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_158", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_158", "inbound_nodes": [[["add_49", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_167", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_167", "inbound_nodes": [[["activation_158", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_167", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_167", "inbound_nodes": [[["conv2d_167", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_159", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_159", "inbound_nodes": [[["batch_normalization_167", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_168", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_168", "inbound_nodes": [[["activation_159", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_168", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_168", "inbound_nodes": [[["conv2d_168", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_160", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_160", "inbound_nodes": [[["batch_normalization_168", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_169", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_169", "inbound_nodes": [[["activation_160", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_169", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_169", "inbound_nodes": [[["conv2d_169", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_50", "trainable": true, "dtype": "float32"}, "name": "add_50", "inbound_nodes": [[["batch_normalization_169", 0, 0, {}], ["activation_158", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_161", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_161", "inbound_nodes": [[["add_50", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_171", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_171", "inbound_nodes": [[["activation_161", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_171", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_171", "inbound_nodes": [[["conv2d_171", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_162", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_162", "inbound_nodes": [[["batch_normalization_171", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_172", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_172", "inbound_nodes": [[["activation_162", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_172", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_172", "inbound_nodes": [[["conv2d_172", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_163", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_163", "inbound_nodes": [[["batch_normalization_172", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_173", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_173", "inbound_nodes": [[["activation_163", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_170", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_170", "inbound_nodes": [[["activation_161", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_173", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_173", "inbound_nodes": [[["conv2d_173", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_170", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_170", "inbound_nodes": [[["conv2d_170", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_51", "trainable": true, "dtype": "float32"}, "name": "add_51", "inbound_nodes": [[["batch_normalization_173", 0, 0, {}], ["batch_normalization_170", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_164", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_164", "inbound_nodes": [[["add_51", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_174", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_174", "inbound_nodes": [[["activation_164", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_174", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_174", "inbound_nodes": [[["conv2d_174", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_165", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_165", "inbound_nodes": [[["batch_normalization_174", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_175", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_175", "inbound_nodes": [[["activation_165", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_175", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_175", "inbound_nodes": [[["conv2d_175", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_166", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_166", "inbound_nodes": [[["batch_normalization_175", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_176", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_176", "inbound_nodes": [[["activation_166", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_176", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_176", "inbound_nodes": [[["conv2d_176", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_52", "trainable": true, "dtype": "float32"}, "name": "add_52", "inbound_nodes": [[["batch_normalization_176", 0, 0, {}], ["activation_164", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_167", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_167", "inbound_nodes": [[["add_52", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_177", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_177", "inbound_nodes": [[["activation_167", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_177", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_177", "inbound_nodes": [[["conv2d_177", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_168", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_168", "inbound_nodes": [[["batch_normalization_177", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_178", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_178", "inbound_nodes": [[["activation_168", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_178", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_178", "inbound_nodes": [[["conv2d_178", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_169", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_169", "inbound_nodes": [[["batch_normalization_178", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_179", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_179", "inbound_nodes": [[["activation_169", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_179", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_179", "inbound_nodes": [[["conv2d_179", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_53", "trainable": true, "dtype": "float32"}, "name": "add_53", "inbound_nodes": [[["batch_normalization_179", 0, 0, {}], ["activation_167", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_170", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_170", "inbound_nodes": [[["add_53", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_180", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_180", "inbound_nodes": [[["activation_170", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_180", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_180", "inbound_nodes": [[["conv2d_180", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_171", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_171", "inbound_nodes": [[["batch_normalization_180", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_181", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_181", "inbound_nodes": [[["activation_171", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_181", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_181", "inbound_nodes": [[["conv2d_181", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_172", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_172", "inbound_nodes": [[["batch_normalization_181", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_182", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_182", "inbound_nodes": [[["activation_172", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_182", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_182", "inbound_nodes": [[["conv2d_182", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_54", "trainable": true, "dtype": "float32"}, "name": "add_54", "inbound_nodes": [[["batch_normalization_182", 0, 0, {}], ["activation_170", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_173", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_173", "inbound_nodes": [[["add_54", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_184", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_184", "inbound_nodes": [[["activation_173", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_184", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_184", "inbound_nodes": [[["conv2d_184", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_174", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_174", "inbound_nodes": [[["batch_normalization_184", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_185", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_185", "inbound_nodes": [[["activation_174", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_185", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_185", "inbound_nodes": [[["conv2d_185", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_175", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_175", "inbound_nodes": [[["batch_normalization_185", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_186", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_186", "inbound_nodes": [[["activation_175", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_183", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_183", "inbound_nodes": [[["activation_173", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_186", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_186", "inbound_nodes": [[["conv2d_186", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_183", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_183", "inbound_nodes": [[["conv2d_183", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_55", "trainable": true, "dtype": "float32"}, "name": "add_55", "inbound_nodes": [[["batch_normalization_186", 0, 0, {}], ["batch_normalization_183", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_176", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_176", "inbound_nodes": [[["add_55", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_187", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_187", "inbound_nodes": [[["activation_176", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_187", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_187", "inbound_nodes": [[["conv2d_187", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_177", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_177", "inbound_nodes": [[["batch_normalization_187", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_188", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_188", "inbound_nodes": [[["activation_177", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_188", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_188", "inbound_nodes": [[["conv2d_188", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_178", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_178", "inbound_nodes": [[["batch_normalization_188", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_189", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_189", "inbound_nodes": [[["activation_178", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_189", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_189", "inbound_nodes": [[["conv2d_189", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_56", "trainable": true, "dtype": "float32"}, "name": "add_56", "inbound_nodes": [[["batch_normalization_189", 0, 0, {}], ["activation_176", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_179", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_179", "inbound_nodes": [[["add_56", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_190", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_190", "inbound_nodes": [[["activation_179", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_190", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_190", "inbound_nodes": [[["conv2d_190", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_180", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_180", "inbound_nodes": [[["batch_normalization_190", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_191", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": 